<a href="https://colab.research.google.com/github/rosemarythomas994/python_basic/blob/main/dummy_variables.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#  TO CONVERT OBJECT DATA TO NUMERICAL VALUES
# 1. DUMMY VARIABLES
# 2. ONE HOT ENCODER
# 3. LABEL ENCODER

In [ ]:
import pandas as pd
from sklearn.linear_model import LinearRegression
data = pd.read_csv('area.csv')
data

  town  area  price
0    a   256  56232
1    a   254  54698
2    b   251  51000
3    c   250  50048
4    b   240  43000
5    c   245  47000

  town  area  price
0    a   256  56232
1    a   254  54698
2    b   251  51000
3    c   250  50048
4    b   240  43000
5    c   245  47000

In [ ]:
dummy = pd.get_dummies(data.town)
dummy

   a  b  c
0  1  0  0
1  1  0  0
2  0  1  0
3  0  0  1
4  0  1  0
5  0  0  1

   a  b  c
0  1  0  0
1  1  0  0
2  0  1  0
3  0  0  1
4  0  1  0
5  0  0  1

In [ ]:
merge_df=pd.concat([data,dummy],axis=1)
merge_df

  town  area  price  a  b  c
0    a   256  56232  1  0  0
1    a   254  54698  1  0  0
2    b   251  51000  0  1  0
3    c   250  50048  0  0  1
4    b   240  43000  0  1  0
5    c   245  47000  0  0  1

  town  area  price  a  b  c
0    a   256  56232  1  0  0
1    a   254  54698  1  0  0
2    b   251  51000  0  1  0
3    c   250  50048  0  0  1
4    b   240  43000  0  1  0
5    c   245  47000  0  0  1

In [ ]:
merge_df.drop(['town'],axis=1,inplace=True)
merge_df

   area  price  a  b  c
0   256  56232  1  0  0
1   254  54698  1  0  0
2   251  51000  0  1  0
3   250  50048  0  0  1
4   240  43000  0  1  0
5   245  47000  0  0  1

   area  price  a  b  c
0   256  56232  1  0  0
1   254  54698  1  0  0
2   251  51000  0  1  0
3   250  50048  0  0  1
4   240  43000  0  1  0
5   245  47000  0  0  1

In [ ]:
x = merge_df.drop(['price'],axis=1)
x

   area  a  b  c
0   256  1  0  0
1   254  1  0  0
2   251  0  1  0
3   250  0  0  1
4   240  0  1  0
5   245  0  0  1

   area  a  b  c
0   256  1  0  0
1   254  1  0  0
2   251  0  1  0
3   250  0  0  1
4   240  0  1  0
5   245  0  0  1

In [ ]:
y = merge_df.price
y

0    56232
1    54698
2    51000
3    50048
4    43000
5    47000
Name: price, dtype: int64

0    56232
1    54698
2    51000
3    50048
4    43000
5    47000
Name: price, dtype: int64

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.2)

In [ ]:
model= LinearRegression()

In [ ]:
model.fit(xtrain,ytrain)

LinearRegression()

LinearRegression()

In [ ]:
model.score(xtest,ytest)

0.89870775

0.89870775

In [ ]:
model.predict([[256,1,0,0]])

C:\Users\DEEPA\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(
C:\Users\DEEPA\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([56232.])

array([56232.])